CSI API ETABS v1
cAreaObj.SetPier Method
 Sets the pier label assignment of one or more area objects
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int SetPier(
	string Name,
	string PierName,
	eItemType ItemType = eItemType.Objects
)
Function SetPier (
	Name As String,
	PierName As String,
	Optional ItemType As eItemType = eItemType.Objects
) As Integer
Dim instance As cAreaObj
Dim Name As String
Dim PierName As String
Dim ItemType As eItemType
Dim returnValue As Integer
returnValue = instance.SetPier(Name, PierName,
	ItemType)
int SetPier(
	String^ Name,
	String^ PierName,
	eItemType ItemType = eItemType::Objects
)
abstract SetPier :
        Name : string *
        PierName : string *
        ?ItemType : eItemType
(* Defaults:
        let _ItemType = defaultArg ItemType eItemType.Objects
*)
-> int
Parameters
Name
Type: System.String
 The name of an existing area object or group, depending on the value of the ItemType item.
PierName
Type: System.String
 The name of the pier assignment, or "None", to unset any assignment
ItemType (Optional)
Type: ETABSv1.eItemType
 This is one of the following items in the eItemType enumeration:
Object = 0
Group = 1
SelectedObjects = 2
 If this item is Objects, the assignment is made to the area object specified by the Name item.
 If this item is Group, the assignment is made to all area objects in the group specified by the Name item.
 If this item is SelectedObjects, assignment is made to all selected area objects, and the Name item is ignored.
Return Value
Type: Int32
 Returns zero if the assignment is successful; otherwise it returns a nonzero value.
Remarks
Examples
Public Sub Example()
   Dim SapModel As cSapModel
   Dim EtabsObject As cOAPI
   Dim ret As Integer = -1
   Dim PierName as String
'create ETABS object
   Dim myHelper as cHelper = New Helper
   EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
'start ETABS application
  ret = EtabsObject.ApplicationStart()
'create SapModel object
   SapModel = EtabsObject.SapModel
'initialize model
   ret = SapModel.InitializeNewModel()
'create steel deck template model
   ret = SapModel.File.NewSteelDeck(4, 12, 12, 4, 4, 24, 24)
'define new pier label
    ret = SapModel.PierLabel.SetPier("MyPier")
'set assignment
    ret = SapModel.AreaObj.SetPier("3", "MyPier")
'get assignment
    ret = SapModel.AreaObj.GetPier("3", PierName)
'close ETABS
   EtabsObject.ApplicationExit(False)
'clean up variables
   SapModel = Nothing
   EtabsObject = Nothing
End Sub
See Also
Reference
cAreaObj Interface
ETABSv1 Namespace